СЦ_Мобильное/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <predefined>
    <items>
      <name>СуперПользователь</name>
      <description>Супер пользователь</description>
    </items>
  </predefined>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

СЦ_Мобильное/src/CommonForms/ФормаАвторизации/Module.bsl
&НаСервере
Функция ОКНаСервере(Пароль)
	// Вставить содержимое обработчика.
	
	Если Не Пользователь.Пустая() Тогда
		Если ПарольПользователя <> "" Тогда
			Если ПарольПользователя <> Пароль Тогда
				Возврат Ложь;
			Иначе
				Возврат истина;
			КонецеСли;	
		Иначе
			Возврат истина;
		КонецеСли;	
	Иначе
		Возврат Истина;
	КонецеСли;
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	Если Не ОКНаСервере(Пароль) Тогда
		Сообщить("Пароль не верен!");
	Иначе
		Закрыть("Ok");
	КонецеСли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Администратор  Тогда
		Пользователь = Справочники.Пользователи.СуперПользователь;
		ПарольПользователя = СокрЛП(Константы.ПарольАдминистратора.Получить());
	Иначе	
		Пользователь = Константы.Пользователь.Получить();
		ПарольПользователя = СокрЛП(Пользователь.Пароль);
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПарольАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Найти(текст,Символы.ПС)>0 И СокрЛП(Текст) <> "" Тогда
		Если ПарольПользователя = СтрЗаменить(Текст, Символы.ПС, "") Тогда
			Пароль = "";
			Закрыть("Ok");
		Иначе
			Пароль = "";
			Сообщить("Пароль не верен!");
		КонецеСли;	
	КонецЕсли;
КонецПроцедуры
